Revit 2027 API
AnalyticalMember.IsValidCurve Method
 Verifies if the curve is valid for an Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidCurve(
	Curve curve
)
Public Shared Function IsValidCurve (
	curve As Curve
) As Boolean
public:
static bool IsValidCurve(
	Curve^ curve
)
static member IsValidCurve :
        curve : Curve -> bool
Parameters
curve Curve
 The curve to be verified.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace